0/fluid/T.liquid
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T.liquid;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    outerLeft
    {
        type symmetryPlane;
    }
    outerRight
    {
        type symmetryPlane;
    }
    inlet
    {
        type fixedValue; value uniform 300;
    }
    outlet
    {
        type inletOutlet; phi phi.liquid; inletValue uniform 300; value uniform 300;
    }
    fluid_to_solid
    {
        type compressible::turbulentTemperatureTwoPhaseRadCoupledMixed; Tnbr T; kappaMethod phaseSystem; region fluid; otherPhase gas; qrNbr none; qr none; value uniform 300;
    }
}
