0/fluid/U.gas
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U.gas;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0.2670797435);
boundaryField
{
    outerLeft
    {
        type symmetryPlane;
    }
    outerRight
    {
        type symmetryPlane;
    }
    inlet
    {
        type fixedValue; value uniform (0 0 0.2670797435);
    }
    outlet
    {
        type pressureInletOutletVelocity; phi phi.gas; value uniform (0 0 0);
    }
    fluid_to_solid
    {
        type noSlip;
    }
}
