0/fluid/U.liquid
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U.liquid;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0.2670797435);
boundaryField
{
    outerLeft
    {
        type symmetryPlane;
    }
    outerRight
    {
        type symmetryPlane;
    }
    inlet
    {
        type flowRateInletVelocity; massFlowRate constant 1.21e-5; rho thermo:rho.liquid; extrapolateProfile no; value uniform (0 0 0.2670797435);
    }
    outlet
    {
        type pressureInletOutletVelocity; phi phi.liquid; value uniform (0 0 0);
    }
    fluid_to_solid
    {
        type noSlip;
    }
}
