0/fluid/alpha.liquid
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object alpha.liquid;
}

dimensions [0 0 0 0 0 0 0];
internalField uniform 0.999999;
boundaryField
{
    outerLeft
    {
        type symmetryPlane;
    }
    outerRight
    {
        type symmetryPlane;
    }
    inlet
    {
        type fixedValue; value uniform 1;
    }
    outlet
    {
        type inletOutlet; phi phi.liquid; inletValue uniform 1; value uniform 1;
    }
    fluid_to_solid
    {
        type zeroGradient;
    }
}
