0/solid/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    outerTop { type calculated; value uniform 101325; }
    outerBottom { type calculated; value uniform 101325; }
    outerLeft
    {
        type symmetryPlane;
    }
    outerRight
    {
        type symmetryPlane;
    }
    inlet
    {
        type calculated; value uniform 101325;
    }
    outlet
    {
        type calculated; value uniform 101325;
    }
    solid_to_fluid
    {
        type calculated; value uniform 101325;
    }
}
