constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          168;
        startFace       96632;
    }
    outlet
    {
        type            patch;
        nFaces          168;
        startFace       96800;
    }
    outerRight
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2400;
        startFace       96968;
    }
    outerLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2400;
        startFace       99368;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        nFaces          5600;
        startFace       101768;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
