constant/fluid/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object thermophysicalProperties.liquid;
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   18;  
    }
    equationOfState
    {
        rho 958.4; // Constant reference liquid density from the original case at 373.15 K
    }
    thermodynamics
    {
        Cp          4216.0;
        Hf 0;
        Tref 373.15;
        Href 0;
    }
    transport
    {
        mu          0.00028176;
        Pr          1.7703430104321904;
    }
}


// ************************************************************************* //
