constant/fluid/turbulenceProperties.gas
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties.gas;
}

simulationType laminar;
