constant/fluid/turbulenceProperties.liquid
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties.liquid;
}

simulationType laminar;
