constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       35136;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       35200;
    }
    outerBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       35264;
    }
    outerRight
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1600;
        startFace       36864;
    }
    outerTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       38464;
    }
    outerLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1600;
        startFace       40064;
    }
)

// ************************************************************************* //
