constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       19960;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       20000;
    }
    outerBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       20040;
    }
    outerRight
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          400;
        startFace       21640;
    }
    outerTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       22040;
    }
    outerLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          400;
        startFace       23640;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       24040;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
