constant/solid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Silicon: material and constant-property assumption from Ghani et al. (2017).
    // Numerical values are external reference data, NOT reported by that paper.
    // Ioffe NSM, SiGe/basic.html, Si (x=0), 300 K: k=1.3 W/(cm K), Cp=0.7 J/(g K).
    // https://www.ioffe.ru/SVA/NSM/Semicond/SiGe/basic.html
    // PDG: density=2.329 g/cm3, atomic mass=28.0855 g/mol.
    // https://pdg.web.cern.ch/pdg/2020/AtomicNuclearProperties/HTML/silicon_Si.html
    specie { molWeight 28.0855; }    // kg/kmol
    transport { kappa 130; }         // W/(m K), held constant
    thermodynamics { Hf 0; Cp 700; } // J/kg and J/(kg K); Hf is reference enthalpy
    equationOfState { rho 2329; }    // kg/m3
}
// ************************************************************************* //
