system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application chtMultiRegionTwoPhaseEulerFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.0150;
deltaT 1e-4;
writeControl adjustableRunTime;
writeInterval 1e-4;
purgeWrite 0;
writeFormat ascii;
writePrecision 10;
writeCompression on;
timeFormat general;
timePrecision 10;
runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.195;
maxDi 10;
maxDeltaT 1e-4;
libs ("libthermoTools.so");

functions
{
    #include "dataReduction"
    #include "cuttingPlanes"
}
