system/cuttingPlanes
cuttingPlanesFluid
{
    type surfaces; libs (sampling); region fluid;
    writeControl writeTime; surfaceFormat vtk;
    fields (p U.liquid U.gas T.liquid T.gas alpha.gas);
    surfaces
    {
        midplane { type cuttingPlane; planeType pointAndNormal;
            pointAndNormalDict { point (0 0 0.005); normal (0 1 0); }
            interpolate true;
        }
    }
}
