system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

PIMPLE { nOuterCorrectors 4; }
