system/snappyHexMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object snappyHexMeshDict;
}
castellatedMesh true;
snap true;
addLayers false;

geometry
{
    Microcanal_m.stl
    {
        type triSurfaceMesh;
        name microcanal;
    }
}
castellatedMeshControls
{
    maxLocalCells 49000;
    maxGlobalCells 49000;
    minRefinementCells 0;
    nCellsBetweenLevels 3;
    features
    (
        { file "Microcanal_m.eMesh"; level 0; }
    );
    refinementSurfaces
    {
        microcanal
        {
            level (0 0);
            faceZone solidFluidInterface;
            cellZone solid;
            cellZoneInside inside;
            faceType internal;
        }
    }
    resolveFeatureAngle 30;
    refinementRegions {};
    locationInMesh (0.000011 0.000013 0.005013);
    allowFreeStandingZoneFaces false;
}
snapControls
{
    nSmoothPatch 0;
    tolerance 1.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 1;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}
addLayersControls {}
meshQualityControls
{
    #includeEtc "caseDicts/meshQualityDict"
    minVol 1e-24;
    minTetQuality 1e-30;
    nSmoothScale 4;
    errorReduction 0.75;
}
mergeTolerance 1e-8; 
